STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/BLE/BLE_SerialCom_Central/STM32_WPAN/App/app_ble.c
  /* Call SNVMA for storing - Without callback */
  SNVMA_Write (APP_BLE_NvmBuffer,
               BLE_NvmCallback);
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

static void Scan_Request(void)
{
  tBleStatus result;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    BSP_LED_On(LED_BLUE);

    result = aci_gap_start_general_discovery_proc(SCAN_INT_MS(500), 
                                                  SCAN_WIN_MS(500), 
                                                  CFG_BD_ADDRESS_TYPE, 1);
    if (result == BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("** START GENERAL DISCOVERY (SCAN) **\n");
    }
    else
    {
      BSP_LED_On(LED_RED);
      LOG_INFO_APP("-- BLE_App_Start_Limited_Disc_Req, Failed 0x%02X\n", result);
    }
  }
  BleStackCB_Process();

  return;
}

static void Central_security_request(void)
{
  tBleStatus status;
  status = aci_gap_send_pairing_req(bleAppContext.BleApplicationContext_legacy.connectionHandle, 0x00);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("Pairing request cmd failure: 0x%02X\n", status);
  }
  else
  {
    LOG_INFO_APP("Pairing request cmd success\n");
  }
  BleStackCB_Process();
}

static void Central_conn_interv_update(void)
{
  tBleStatus status;
  uint32_t paramA, paramB, paramC, paramD, paramE, paramF;
  paramC = 0x0000;
  paramD = 0x01F4;

  if (bleAppContext.connIntervalFlag != 0)
  {
    bleAppContext.connIntervalFlag = 0;
    paramA = CONN_INT_MS(11.25);
    paramB = CONN_INT_MS(11.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(11.25);
  }
  else
  {
    bleAppContext.connIntervalFlag = 1;
    paramA = CONN_INT_MS(26.25);
    paramB = CONN_INT_MS(26.25);
    paramE = 0x00;
    paramF = CONN_CE_LENGTH_MS(26.25);
  }
    
  status = aci_gap_start_connection_update(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                           paramA,
                                           paramB,
                                           paramC,
                                           paramD,
                                           paramE,
                                           paramF);
  if (status != BLE_STATUS_SUCCESS)
  {
    LOG_INFO_APP("aci_gap_start_connection_update() Failed, status 0x%02X\n",status);
  }
  else
  {
    LOG_INFO_APP("aci_gap_start_connection_update(), Successfully\n");
  }
  BleStackCB_Process();
}

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    UTIL_SEQ_SetTask(1<<CFG_TASK_START_SCAN_ID, CFG_SEQ_PRIO_0);
  }
  else
  {    
    if (real_time == 0)
    {
      real_time = 1;
      LOG_INFO_APP("Real time mode\n");
    }
    else
    {
      real_time = 0;
      LOG_INFO_APP("Send data mode \n");
    }  
  }
  return;
}

void APPE_Button2Action(void)
{
  tBleStatus status;
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
    status = aci_gap_clear_security_db();
    if (status != BLE_STATUS_SUCCESS)
    {
      LOG_INFO_APP("Clear security DB cmd failure: 0x%02X\n", status);
    }
    else
    {
      LOG_INFO_APP("Clear security DB cmd success\n");
    }
  }
  else
  {
    LOG_INFO_APP("**SECURITY REQ \n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_CENTRAL_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }
  return;
}

void APPE_Button3Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_CLIENT)
  {
  }
  else
  {
    LOG_INFO_APP("**CONN INTERVAL TOGGLE\n");
    UTIL_SEQ_SetTask(1U << CFG_TASK_CENTRAL_CONN_INTERV_UPDATE_ID, CFG_SEQ_PRIO_0);
  }
  return;
}
#endif
/* USER CODE END FD_WRAP_FUNCTIONS */
